espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/flex/component/rail/sl_flex_rail_802154_support/sl_flex_ieee802154_support.c
/***************************************************************************//**
 * @file
 * @brief sl_flex_ieee802154_support.c
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/
// -----------------------------------------------------------------------------
//                                   Includes
// -----------------------------------------------------------------------------
#include <stdint.h>
#include <string.h>
#include "em_system.h"
#include "app_log.h"
#include "sl_component_catalog.h"
#include "sl_flex_util_802154_protocol.h"
#include "sl_flex_ieee802154_support.h"

// -----------------------------------------------------------------------------
//                              Macros and Typedefs
// -----------------------------------------------------------------------------
#define ADDRESS_FILTER_INDEX                        (0U)

// -----------------------------------------------------------------------------
//                          Static Function Declarations
// -----------------------------------------------------------------------------
static void sl_flex_ieee802154_change_std(RAIL_Handle_t rail_handle,
                                          sl_flex_ieee802154_std_t std,
                                          sl_flex_ieee802154_frame_t *tx_frame,
                                          sl_flex_ieee802154_std_t* current_std,
                                          bool* current_ack,
                                          uint16_t *channel);

/**************************************************************************//**
 * The function initializes the IEEE 802.15.4 or IEEE 802.15.4g.
 *
 * @param[in] r_handle        RAIL handle
 * @param[in] std             desired std. (IEEE 802.15.4 or IEEE 802.15.4g)
 * @return int16_t
 * @retval APP_IEEE802154_ERROR   the initialization failed
 * @retval APP_IEEE802154_OK      the initialization run successfully
 *****************************************************************************/
static int16_t sl_flex_ieee802154_reinit(RAIL_Handle_t r_handle,
                                         sl_flex_ieee802154_std_t std);

/**************************************************************************//**
 * The function gives back if the ACK requested or not.
 *
 * @return ACK request status
 * @retval true ACK requested
 * @retval false ACK not requested
 *****************************************************************************/
bool sl_flex_ieee802154_get_ack_status(void);

/**************************************************************************//**
 * This function sets the PAN ID address for address filter.
 *
 * @param[in] r_handle        RAIL handle
 * @param[in] address         desired PAN ID address
 * @return int16_t
 * @retval APP_IEEE802154_ERROR   it failed
 * @retval APP_IEEE802154_OK      it run successfully
 *****************************************************************************/
static int16_t sl_flex_ieee802154_set_pan_id_filter(RAIL_Handle_t r_handle,
                                                    uint16_t address);

/**************************************************************************//**
 * This function sets the Short/Source address for address filter.
 *
 * @param[in] r_handle        RAIL handle
 * @param[in] address         desired Short/Source address
 * @return int16_t
 * @retval APP_IEEE802154_ERROR   it failed
 * @retval APP_IEEE802154_OK      it run successfully
 *****************************************************************************/
static int16_t sl_flex_ieee802154_set_short_addr_filter(RAIL_Handle_t r_handle,
                                                        uint16_t address);

/**************************************************************************//**
 * This function sets the Long address for address filter.
 *
 * @param[in] r_handle        RAIL handle
 * @param[in] *address        desired Long address's pointer
 * @return int16_t
 * @retval APP_IEEE802154_ERROR   it failed
 * @retval APP_IEEE802154_OK      it run successfully
 *****************************************************************************/
static int16_t sl_flex_ieee802154_set_long_addr_filter(RAIL_Handle_t r_handle,
                                                       uint64_t *address);

// -----------------------------------------------------------------------------
//                                Global Variables
// -----------------------------------------------------------------------------

// -----------------------------------------------------------------------------
//                                Static Variables
// -----------------------------------------------------------------------------
/// currently used standard
static sl_flex_ieee802154_std_t standard_protocol =
  SL_FLEX_IEEE802154_STD_IEEE802154_2P4GHZ;
/// currently requested or not ACK
static bool is_ack_requested = false;
/// currently used channel for standard
static uint16_t channel = 0U;
/// system number, all devices have unique number.
static uint64_t system_number = 0U;
/// CSMA/CA configuration structure for IEEE 502.15.4 2003 2p4 GHz
static RAIL_CsmaConfig_t csma_config_2p4 =
  RAIL_CSMA_CONFIG_802_15_4_2003_2p4_GHz_OQPSK_CSMA;
/// CSMA/CA configuration structure for IEEE 502.15.4g
static RAIL_CsmaConfig_t csma_config_sub = {
  .csmaMinBoExp = 3,      // 2^3-1 for 0..7 backoffs on 1st try
  .csmaMaxBoExp = 5,      // 2^5-1 for 0..31 backoffs on 3rd+ tries
  .csmaTries = 5,         // 5 tries overall (4 re-tries)
  .ccaThreshold = -81,    // 10 dB above sensitivity
  .ccaBackoff = 1160,     // 1ms+ ccaDuration
  .ccaDuration = 160,     // 8 symbols at 20 us/symbol
  .csmaTimeout = 0,       // no timeout
};
