espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/flex/component/rail/sl_flex_rail_802154_support/sl_flex_ieee802154_support.c
// -----------------------------------------------------------------------------
//                          Public Function Definitions
// -----------------------------------------------------------------------------
int16_t sl_flex_ieee802154_protocol_init(RAIL_Handle_t r_handle,
                                         sl_flex_util_802154_protocol_type_t protocol)
{
  // based on the protocol (used via UC) setups the communication considering
  // the RF bands as well
  int16_t status = SL_FLEX_IEEE802154_OK;

  switch (protocol) {
    case SL_FLEX_UTIL_PROTOCOL_IEEE802154_2P4GHZ:
    case SL_FLEX_UTIL_PROTOCOL_IEEE802154_2P4GHZ_ANTDIV:
    case SL_FLEX_UTIL_PROTOCOL_IEEE802154_2P4GHZ_COEX:
    case SL_FLEX_UTIL_PROTOCOL_IEEE802154_2P4GHZ_ANTDIV_COEX:
      standard_protocol = SL_FLEX_IEEE802154_STD_IEEE802154_2P4GHZ;
      channel = SL_FLEX_IEEE802154_CHANNEL_2P4;
      break;
    case SL_FLEX_UTIL_PROTOCOL_IEEE802154_GB868_915MHZ:
      standard_protocol = SL_FLEX_IEEE802154_STD_IEEE802154G_915MHZ;
      channel = SL_FLEX_IEEE802154_CHANNEL_915;
      break;
    case SL_FLEX_UTIL_PROTOCOL_IEEE802154_GB868_863MHZ:
      standard_protocol = SL_FLEX_IEEE802154_STD_IEEE802154G_863MHZ;
      channel = SL_FLEX_IEEE802154_CHANNEL_863;
      break;
    default:
      status = SL_FLEX_IEEE802154_UNSUPPORTED_PROTOCOL;
      break;
  }

  if (status != SL_FLEX_IEEE802154_OK) {
    return status;
  }

  // sets the PAN ID (by default for broadcast)
  (void)sl_flex_ieee802154_set_pan_id_filter(r_handle,
                                             DEFAULT_BROADCAST_PAN_ID);
  // sets the Short address/Source address (by default for Broadcast)
  (void)sl_flex_ieee802154_set_short_addr_filter(r_handle,
                                                 DEFAULT_BROADCAST_SRC_ADDR);
  // obtains the unique number of the system
  system_number = SYSTEM_GetUnique();
  // sets the long address
  (void)sl_flex_ieee802154_set_long_addr_filter(r_handle, &system_number);

  return status;
}

sl_flex_ieee802154_std_t sl_flex_ieee802154_get_std(void)
{
  return standard_protocol;
}

uint16_t sl_flex_ieee802154_get_channel(void)
{
  return channel;
}

void sl_flex_ieee802154_print_frame(sl_flex_ieee802154_std_t std,
                                    sl_flex_ieee802154_frame_t *frame)
{
  if (frame == NULL) {
    app_log_error("sl_flex_ieee802154_print_frame ERR: parameter\n");
    return;
  }

  const uint8_t *tmp_payload = (uint8_t*)frame->payload;

  // prints the PHR information in case of g option
  if ((std == SL_FLEX_IEEE802154_STD_IEEE802154G_863MHZ)
      || (std == SL_FLEX_IEEE802154_STD_IEEE802154G_915MHZ)) {
    app_log_info("PHR DW,CRC cfg (0x%02X):\n", frame->phr_config);
    app_log_info("  Whitening:         %s\n",
                 frame->phr_config & SL_FLEX_IEEE802154G_PHR_DATA_WHITENING_ON ? "ON" : "OFF");
    app_log_info("  CRC length:        %s\n",
                 frame->phr_config & SL_FLEX_IEEE802154G_PHR_CRC_2_BYTE ? "2B" : "4B");
  }

  // prints the MHR parameters
  app_log_info("MHR field:\n");
  app_log_info("  Frame control:     0x%04X\n", frame->mhr_config.frame_control);
  app_log_info("  Seq. number:       0x%02X\n", frame->mhr_config.sequence_number);
  app_log_info("  PAN ID:            0x%04X\n", frame->mhr_config.destination_pan_id);
  app_log_info("  Dest. address:     0x%04X\n", frame->mhr_config.destination_address);
  app_log_info("  Src address:       0x%04X\n", frame->mhr_config.source_address);

  // prints the payload
  app_log_info("Payload: ");
  for (uint8_t i = 0; i < frame->payload_size; i++) {
    app_log_info("0x%02X, ", tmp_payload[i]);
  }
  app_log_info("\n");
}

void sl_flex_ieee802154_print_ack(sl_flex_ieee802154_std_t std,
                                  const uint8_t *buffer)
{
  uint8_t size = 0U;

  if (buffer == NULL) {
    app_log_error("sl_flex_ieee802154_print_ack ERR: parameter\n");
    return;
  }

  if (std == SL_FLEX_IEEE802154_STD_IEEE802154_2P4GHZ) {
    size = SL_FLEX_IEEE802154_ACK_PACKET_LENGTH;
  } else {
    size = SL_FLEX_IEEE802154G_ACK_PACKET_LENGTH;
  }

  app_log_info("ACK: ");
  for (uint8_t i = 0; i < size; i++) {
    app_log_info("0x%02X, ", buffer[i]);
  }
  app_log_info("\n");
}

void sl_flex_ieee802154_request_manager(RAIL_Handle_t r_handle,
                                        sl_flex_ieee802154_frame_t *tx_frame,
                                        volatile sl_flex_ieee802154_cli_requests *cli_req,
                                        volatile sl_flex_ieee802154_cli_data *cli_desired)
{
  if (tx_frame == NULL || cli_req == NULL || cli_desired == NULL) {
    app_log_error("sl_flex_ieee802154_request_manager ERR: parameter\n");
    return;
  }

  // Std change request received
  if (cli_req->std_requested) {
    cli_req->std_requested = false;
    sl_flex_ieee802154_change_std(r_handle,
                                  cli_desired->desired_std, tx_frame,
                                  &standard_protocol, &is_ack_requested,
                                  &channel);
  }

  // PAN ID change request received
  if (cli_req->panid_requested) {
    cli_req->panid_requested = false;
    tx_frame->mhr_config.destination_pan_id = cli_desired->desired_panid;
    // re-set the addresses
    (void)sl_flex_ieee802154_set_pan_id_filter(r_handle,
                                               tx_frame->mhr_config.destination_pan_id);
  }

  // Source address change request received
  if (cli_req->srcaddr_requested) {
    cli_req->srcaddr_requested = false;
    tx_frame->mhr_config.source_address = cli_desired->desired_srcaddr;
    // re-set the addresses
    (void)sl_flex_ieee802154_set_short_addr_filter(r_handle,
                                                   tx_frame->mhr_config.source_address);
  }

  // Destination address change request received
  if (cli_req->destaddr_requested) {
    cli_req->destaddr_requested = false;
    tx_frame->mhr_config.destination_address = cli_desired->desired_destaddr;
  }

  // Auto-ACK change request received
  if (cli_req->ack_requested) {
    cli_req->ack_requested = false;
    is_ack_requested = cli_desired->desired_ack;
    if (is_ack_requested == true) {
      // sets the ACK req. in the FCF
      tx_frame->mhr_config.frame_control |= MAC_FRAME_FLAG_ACK_REQUIRED;
    } else {
      // clear the ACK req. in  the FCF
      tx_frame->mhr_config.frame_control &= ~MAC_FRAME_FLAG_ACK_REQUIRED;
    }
  }

  // Data whitening change request received
  if (cli_req->cfgdw_requested) {
    cli_req->cfgdw_requested = false;
    if (cli_desired->desired_dw) {
      tx_frame->phr_config |= SL_FLEX_IEEE802154G_PHR_DATA_WHITENING_ON;
    } else {
      tx_frame->phr_config &= ~SL_FLEX_IEEE802154G_PHR_DATA_WHITENING_ON;
    }
  }

  // CRC size change request received
  if (cli_req->cfgcrc_requested) {
    cli_req->cfgcrc_requested = false;
    if (cli_desired->desired_crc == SL_FLEX_IEEE802154G_CRC_LENGTH_2BYTE) {
      // 2 bytes
      tx_frame->phr_config |= SL_FLEX_IEEE802154G_PHR_CRC_2_BYTE;
    } else {
      // 4 bytes
      tx_frame->phr_config &= ~SL_FLEX_IEEE802154G_PHR_CRC_2_BYTE;
    }
  }
}

void sl_flex_ieee802154_prepare_sending(sl_flex_ieee802154_frame_t *tx_frame,
                                        void* payload, uint16_t payload_size)
{
  if (tx_frame == NULL || payload == NULL || payload_size == 0) {
    app_log_error("sl_flex_ieee802154_prepare_sending ERR: parameter\n");
    return;
  }
  tx_frame->mhr_config.sequence_number++;
  tx_frame->payload = payload;
  tx_frame->payload_size = payload_size;
}

void sl_flex_ieee802154_update_status(sl_flex_ieee802154_status_t *comm_status,
                                      const sl_flex_ieee802154_frame_t *tx_frame)
{
  if (comm_status == NULL || tx_frame == NULL) {
    app_log_error("sl_flex_ieee802154_update_status ERR: parameter\n");
    return;
  }

