espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/flex/component/rail/sl_flex_rail_802154_support/sl_flex_ieee802154_support.c
  comm_status->std = sl_flex_ieee802154_get_std();
  comm_status->ack = sl_flex_ieee802154_get_ack_status();
  comm_status->channel = sl_flex_ieee802154_get_channel();
  comm_status->destination_pan_id = tx_frame->mhr_config.destination_pan_id;
  comm_status->source_address = tx_frame->mhr_config.source_address;
  comm_status->destination_address = tx_frame->mhr_config.destination_address;
  comm_status->destination_pan_id = tx_frame->mhr_config.destination_pan_id;

  if ((comm_status->std == SL_FLEX_IEEE802154_STD_IEEE802154G_863MHZ)
      || (comm_status->std == SL_FLEX_IEEE802154_STD_IEEE802154G_915MHZ)) {
    if ((tx_frame->phr_config & SL_FLEX_IEEE802154G_PHR_DATA_WHITENING_ON)
        == SL_FLEX_IEEE802154G_PHR_DATA_WHITENING_ON) {
      comm_status->data_whitening = true;
    } else {
      comm_status->data_whitening = false;
    }

    if ((tx_frame->phr_config & SL_FLEX_IEEE802154G_PHR_CRC_2_BYTE)
        == SL_FLEX_IEEE802154G_PHR_CRC_2_BYTE) {
      comm_status->crc_length = SL_FLEX_IEEE802154G_CRC_LENGTH_2BYTE;
    } else {
      comm_status->crc_length = SL_FLEX_IEEE802154G_CRC_LENGTH_4BYTE;
    }
  }
}

bool sl_flex_ieee802154_is_change_requested(
  volatile sl_flex_ieee802154_cli_requests *cli_requests)
{
  if (cli_requests == NULL) {
    app_log_error("sl_flex_ieee802154_is_change_requested ERR: parameter\n");
    return false;
  }

  return cli_requests->std_requested || cli_requests->panid_requested
         || cli_requests->srcaddr_requested || cli_requests->destaddr_requested
         || cli_requests->ack_requested || cli_requests->cfgdw_requested
         || cli_requests->cfgcrc_requested;
}

RAIL_Status_t sl_flex_ieee802154_transmission(RAIL_Handle_t rail_handle,
                                              const uint8_t *packet,
                                              uint16_t packet_size)
{
  RAIL_Status_t status;
  RAIL_TxOptions_t txOptions = RAIL_TX_OPTIONS_NONE;
  RAIL_SchedulerInfo_t* scheduler_ptr = NULL;
#ifdef SL_CATALOG_BLUETOOTH_PRESENT
  RAIL_SchedulerInfo_t scheduler_info = (RAIL_SchedulerInfo_t){ .priority = 100,
                                                                .slipTime = 100000,
                                                                .transactionTime = 2500 };
  scheduler_ptr = &scheduler_info;
#endif

  if (packet == NULL || packet_size == 0) {
    app_log_error("sl_flex_ieee802154_transmission ERR: parameter\n");
    return RAIL_STATUS_INVALID_PARAMETER;
  }

  // sets the tx options based on the current ACK settings (auto-ACK enabled?)
  if (sl_flex_ieee802154_get_ack_status()) {
    txOptions = RAIL_TX_OPTION_WAIT_FOR_ACK;
  } else {
    txOptions = RAIL_TX_OPTIONS_NONE;
  }

  // writes the TX FIFO
  RAIL_WriteTxFifo(rail_handle, packet, packet_size, true);

  if (sl_flex_ieee802154_get_std() == SL_FLEX_IEEE802154_STD_IEEE802154_2P4GHZ) {
    // starts the TX on the desired channel with the tx option and CSMA
    // functionality
    status = RAIL_StartCcaCsmaTx(rail_handle,
                                 sl_flex_ieee802154_get_channel(),
                                 txOptions,
                                 &csma_config_2p4,
                                 scheduler_ptr);
    if (status != RAIL_STATUS_NO_ERROR) {
      app_log_error("RAIL_StartCcaCsmaTx status: %d failed", status);
    }
  } else {
    // starts the TX on the desired channel with the tx option and CSMA
    // functionality
    status = RAIL_StartCcaCsmaTx(rail_handle,
                                 sl_flex_ieee802154_get_channel(),
                                 txOptions,
                                 &csma_config_sub,
                                 scheduler_ptr);

    if (status != RAIL_STATUS_NO_ERROR) {
      app_log_error("RAIL_StartCcaCsmaTx status: %d failed", status);
    }
  }

  return status;
}

int16_t sl_flex_ieee802154_pack_data_frame(sl_flex_ieee802154_std_t std,
                                           sl_flex_ieee802154_frame_t *frame,
                                           uint16_t *frame_size,
                                           uint8_t *frame_buffer)
{
  uint16_t ret_val = 0;

  if ((frame == NULL) || (frame_size == NULL) || (frame_buffer == NULL)) {
    app_log_error("sl_flex_ieee802154_pack_data_frame ERR: parameter");
    return SL_FLEX_IEEE802154_ERROR;
  }

  switch (std) {
    case SL_FLEX_IEEE802154_STD_IEEE802154_2P4GHZ:
      ret_val = sl_flex_802154_packet_pack_data_frame(&frame->mhr_config,
                                                      frame->payload_size,
                                                      frame->payload,
                                                      frame_size,
                                                      frame_buffer);
      break;
    case SL_FLEX_IEEE802154_STD_IEEE802154G_863MHZ:
    case SL_FLEX_IEEE802154_STD_IEEE802154G_915MHZ:
      ret_val = sl_flex_802154_packet_pack_g_opt_data_frame(frame->phr_config,
                                                            &frame->mhr_config,
                                                            frame->payload_size,
                                                            frame->payload,
                                                            frame_size,
                                                            frame_buffer);
      break;
    default:
      ret_val = SL_FLEX_IEEE802154_UNSUPPORTED_PROTOCOL;
      break;
  }

  return ret_val;
}

int16_t sl_flex_ieee802154_unpack_data_frame(sl_flex_ieee802154_std_t std,
                                             sl_flex_ieee802154_frame_t *frame,
                                             uint8_t *frame_buffer,
                                             uint16_t max_frame_size)
{
  uint16_t max_payload_size = 0U;
  int16_t status = SL_FLEX_IEEE802154_OK;

  if ((frame == NULL) || (frame_buffer == NULL)) {
    app_log_error("sl_flex_ieee802154_unpack_data_frame ERR: parameter");
    return SL_FLEX_IEEE802154_ERROR;
  }

  switch (std) {
    case SL_FLEX_IEEE802154_STD_IEEE802154_2P4GHZ:
      frame->payload = sl_flex_802154_packet_unpack_data_frame(&frame->mhr_config,
                                                               &frame->payload_size,
                                                               frame_buffer);
      if (frame->payload == NULL) {
        app_log_warning("sl_flex_802154_packet_unpack_data_frame failed");
        status = SL_FLEX_IEEE802154_ERROR;
        break;
      }

      // max payload calculation
      max_payload_size = max_frame_size
                         - SL_FLEX_IEEE802154_PHR_LENGTH
                         - SL_FLEX_IEEE802154_MHR_LENGTH
                         - SL_FLEX_IEEE802154_CRC_LENGTH;

      // checks the size of the received payload
      if (frame->payload_size > max_payload_size) {
        app_log_warning("sl_flex_802154_packet_unpack_data_frame failed: Corrupted frame received: payload is too large.");
        status = SL_FLEX_IEEE802154_ERROR;
        break;
      }

      break;
    case SL_FLEX_IEEE802154_STD_IEEE802154G_863MHZ:
    case SL_FLEX_IEEE802154_STD_IEEE802154G_915MHZ:
      frame->payload = sl_flex_802154_packet_unpack_g_opt_data_frame(
        &frame->phr_config,
        &frame->mhr_config,
        &frame->payload_size,
        frame_buffer);

      if (frame->payload == NULL) {
        app_log_warning("sl_flex_802154_packet_unpack_data_frame failed");
        status = SL_FLEX_IEEE802154_ERROR;
        break;
      }

      // considering the size of the CRC the max payload is calculated
      if (frame->phr_config & SL_FLEX_IEEE802154G_PHR_CRC_2_BYTE) {
        max_payload_size = max_frame_size
                           - SL_FLEX_IEEE802154G_PHR_LENGTH
                           - SL_FLEX_IEEE802154_MHR_LENGTH
                           - SL_FLEX_IEEE802154G_CRC_LENGTH_2BYTE;
      } else {
        max_payload_size = max_frame_size
                           - SL_FLEX_IEEE802154G_PHR_LENGTH
                           - SL_FLEX_IEEE802154_MHR_LENGTH
                           - SL_FLEX_IEEE802154G_CRC_LENGTH_4BYTE;
      }

      // checks the size of the received payload
      if (frame->payload_size > max_payload_size) {
        app_log_warning("sl_flex_802154_packet_unpack_data_frame failed: Corrupted frame received: payload is too large.");
        status = SL_FLEX_IEEE802154_ERROR;
        break;
      }

      break;
    default:
      status = SL_FLEX_IEEE802154_UNSUPPORTED_PROTOCOL;
      break;
  }

