espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/flex/component/rail/sl_flex_rail_802154_support/sl_flex_ieee802154_support.c
  return status;
}

// -----------------------------------------------------------------------------
//                          Static Function Definitions
// -----------------------------------------------------------------------------
/*******************************************************************************
 * This helper function handles the standard change.
 ******************************************************************************/
static void sl_flex_ieee802154_change_std(RAIL_Handle_t rail_handle,
                                          sl_flex_ieee802154_std_t std,
                                          sl_flex_ieee802154_frame_t *tx_frame,
                                          sl_flex_ieee802154_std_t* current_std,
                                          bool* current_ack,
                                          uint16_t *new_channel)
{
  *current_std = std;

  // clear the seq.#
  tx_frame->mhr_config.sequence_number = 0U;
  // clear the ACK req. in  the FCF
  tx_frame->mhr_config.frame_control &= ~MAC_FRAME_FLAG_ACK_REQUIRED;
  *current_ack = false;
  // set default value
  tx_frame->mhr_config.destination_pan_id = DEFAULT_BROADCAST_PAN_ID;
  // set default value
  tx_frame->mhr_config.source_address = DEFAULT_BROADCAST_SRC_ADDR;
  // set default value
  tx_frame->mhr_config.destination_address = DEFAULT_BROADCAST_DEST_ADDR;

  if ((*current_std == SL_FLEX_IEEE802154_STD_IEEE802154G_863MHZ)
      || (*current_std == SL_FLEX_IEEE802154_STD_IEEE802154G_915MHZ)) {
    // release PHR config
    tx_frame->phr_config = 0x00;
    // 2-bytes CRC
    tx_frame->phr_config |= SL_FLEX_IEEE802154G_PHR_CRC_2_BYTE;
    // Data whitening default settings
    if ((RAIL_IEEE802154_SUPPORTS_G_UNWHITENED_RX == 0)
        && (RAIL_IEEE802154_SUPPORTS_G_UNWHITENED_TX == 0)) {
      tx_frame->phr_config |= SL_FLEX_IEEE802154G_PHR_DATA_WHITENING_ON;
    } else {
      tx_frame->phr_config &= ~SL_FLEX_IEEE802154G_PHR_DATA_WHITENING_ON;
    }
  }

  // setting the channel
  switch (*current_std) {
    case SL_FLEX_IEEE802154_STD_IEEE802154_2P4GHZ:
      *new_channel = SL_FLEX_IEEE802154_CHANNEL_2P4;
      break;
    case SL_FLEX_IEEE802154_STD_IEEE802154G_863MHZ:
      *new_channel = SL_FLEX_IEEE802154_CHANNEL_863;
      break;
    case SL_FLEX_IEEE802154_STD_IEEE802154G_915MHZ:
      *new_channel = SL_FLEX_IEEE802154_CHANNEL_915;
      break;
    default:
      break;
  }

  // initializes the IEEE 802.15.4 or the IEEE 802.15.4G
  (void)sl_flex_ieee802154_reinit(rail_handle, *current_std);
  // sets the previous PAN ID
  (void)sl_flex_ieee802154_set_pan_id_filter(rail_handle,
                                             tx_frame->mhr_config.destination_pan_id);
  // sets the previous short address
  (void)sl_flex_ieee802154_set_short_addr_filter(rail_handle,
                                                 tx_frame->mhr_config.source_address);
  // sets the long address
  (void)sl_flex_ieee802154_set_long_addr_filter(rail_handle, &system_number);
}

/*******************************************************************************
 * This helper function reinit the IEEE 802.15.4
 ******************************************************************************/
static int16_t sl_flex_ieee802154_reinit(RAIL_Handle_t r_handle,
                                         sl_flex_ieee802154_std_t std)
{
  RAIL_Status_t status = RAIL_STATUS_NO_ERROR;

  switch (std) {
    case SL_FLEX_IEEE802154_STD_IEEE802154_2P4GHZ:
      // configures the IEEE 802.15.4 on 2.4GHz
      sl_flex_util_802154_protocol_config(r_handle,
                                          SL_FLEX_UTIL_PROTOCOL_IEEE802154_2P4GHZ);
      if (status != RAIL_STATUS_NO_ERROR) {
        app_log_error("sl_rail_util_protocol_config status: %d failed", status);
        return SL_FLEX_IEEE802154_ERROR;
      }
      break;
    case SL_FLEX_IEEE802154_STD_IEEE802154G_863MHZ:
      sl_flex_util_802154_protocol_config(r_handle,
                                          SL_FLEX_UTIL_PROTOCOL_IEEE802154_GB868_863MHZ);
      if (status != RAIL_STATUS_NO_ERROR) {
        app_log_error("sl_rail_util_protocol_config status: %d failed", status);
        return SL_FLEX_IEEE802154_ERROR;
      }
      break;
    case SL_FLEX_IEEE802154_STD_IEEE802154G_915MHZ:
      sl_flex_util_802154_protocol_config(r_handle,
                                          SL_FLEX_UTIL_PROTOCOL_IEEE802154_GB868_915MHZ);
      if (status != RAIL_STATUS_NO_ERROR) {
        app_log_error("sl_rail_util_protocol_config status: %d failed", status);
        return SL_FLEX_IEEE802154_ERROR;
      }
      break;
    default:
      status = RAIL_STATUS_INVALID_PARAMETER;
      break;
  }

  if (status != RAIL_STATUS_NO_ERROR) {
    return SL_FLEX_IEEE802154_ERROR;
  }

  // configures G options for IEEE 802.15.4g (863/915MHz)
  if ((std == SL_FLEX_IEEE802154_STD_IEEE802154G_863MHZ)
      || (std == SL_FLEX_IEEE802154_STD_IEEE802154G_915MHZ)) {
    // sets the IEEE802154g
    status = RAIL_IEEE802154_ConfigGOptions(r_handle,
                                            RAIL_IEEE802154_G_OPTION_GB868,
                                            RAIL_IEEE802154_G_OPTION_GB868);
    if (status != RAIL_STATUS_NO_ERROR) {
      app_log_error("RAIL_IEEE802154_ConfigGOptions status: %d failed", status);
      return SL_FLEX_IEEE802154_ERROR;
    }
  }

  // all settings has been successful.
  return SL_FLEX_IEEE802154_OK;
}

/*******************************************************************************
 * This helper function returns a boolean about the ACK requested or not.
 ******************************************************************************/
bool sl_flex_ieee802154_get_ack_status(void)
{
  return is_ack_requested;
}

/*******************************************************************************
 * This helper function sets the PAN ID into the filter.
 ******************************************************************************/
static int16_t sl_flex_ieee802154_set_pan_id_filter(RAIL_Handle_t r_handle,
                                                    uint16_t address)
{
  RAIL_Status_t status = RAIL_STATUS_NO_ERROR;
  // sets the addresses for filtering
  status = RAIL_IEEE802154_SetPanId(r_handle, address, ADDRESS_FILTER_INDEX);
  if (status != RAIL_STATUS_NO_ERROR) {
    app_log_error("app_ieee802154_set_pan_id_filter() status: %d failed", status);
    return SL_FLEX_IEEE802154_ERROR;
  }

  return SL_FLEX_IEEE802154_OK;
}

