espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/flex/component/rail/sl_flex_rail_802154_support/sl_flex_ieee802154_support.c
/*******************************************************************************
 * This helper function sets the short address into filter.
 ******************************************************************************/
static int16_t sl_flex_ieee802154_set_short_addr_filter(RAIL_Handle_t r_handle,
                                                        uint16_t address)
{
  RAIL_Status_t status = RAIL_STATUS_NO_ERROR;
  // sets the addresses for filtering
  status = RAIL_IEEE802154_SetShortAddress(r_handle, address,
                                           ADDRESS_FILTER_INDEX);
  if (status != RAIL_STATUS_NO_ERROR) {
    app_log_error("RAIL_IEEE802154_SetShortAddress() status: %d failed", status);
    return SL_FLEX_IEEE802154_ERROR;
  }

  return SL_FLEX_IEEE802154_OK;
}

/*******************************************************************************
 * This helper function sets the long address into filter.
 ******************************************************************************/
static int16_t sl_flex_ieee802154_set_long_addr_filter(RAIL_Handle_t r_handle,
                                                       uint64_t *address)
{
  RAIL_Status_t status = RAIL_STATUS_NO_ERROR;
  // sets the addresses for filtering
  status = RAIL_IEEE802154_SetLongAddress(r_handle, (uint8_t*)address,
                                          ADDRESS_FILTER_INDEX);
  if (status != RAIL_STATUS_NO_ERROR) {
    app_log_error("RAIL_IEEE802154_SetLongAddress() status: %d failed", status);
    return SL_FLEX_IEEE802154_ERROR;
  }

  return SL_FLEX_IEEE802154_OK;
}
